In [1]:
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input
password = getpass.getpass()

········

In [91]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank'
engine = create_engine(connection_string)

querry1= "select customer_id, count(rental_id) as rentals_may \
from sakila.rentals_may \
group by customer_id;"

data_may = pd.read_sql_query(querry1, engine)
data_may.head()

   customer_id  rentals_may
0          130            2
1          459            1
2          408            3
3          333            1
4          222            5

In [92]:
querry2= "select customer_id, count(rental_id) as rentals_june \
from sakila.rentals_june \
group by customer_id;"

data_june = pd.read_sql_query(querry2, engine)
data_june.head()

   customer_id  rentals_june
0          416             5
1          516             6
2          239             5
3          285             3
4          310             6

In [93]:
data_june=data_june.set_index("customer_id")

In [94]:
data_may=data_may.set_index("customer_id")

In [95]:
data_june.head()

             rentals_june
customer_id
416                     5
516                     6
239                     5
285                     3
310                     6

In [96]:
data_new=pd.concat([data_june,data_may],axis=1)

In [121]:
data_new.shape

(598, 2)

In [101]:
data_new.fillna(0)

             rentals_june  rentals_may
customer_id
1                     7.0          2.0
2                     1.0          1.0
3                     4.0          2.0
4                     6.0          0.0
5                     5.0          3.0
...                   ...          ...
595                   2.0          1.0
596                   2.0          6.0
597                   3.0          2.0
598                   1.0          0.0
599                   4.0          1.0

[598 rows x 2 columns]

In [125]:
def retalChecker(i):
    subs = data_new.loc[i,:][0] - data_new.loc[i,:][1]
    if subs > 0:
        return 'Customer borrowed more ({}) books in May'.format(subs)
    elif subs < 0:
        return 'Customer borrowed more ({}) books in June'.format(-(subs))
    else:
        return 'Customer borrowed the same books, {}, in both monts'.format(data_new.loc[i,:][1])
retalChecker(10)

'Customer borrowed more (4.0) books in May'